[
  {
    "title": "Trump announces new auto tariffs in a major trade war escalation",
    "url": "https://www.cnn.com/2025/03/26/economy/auto-tariffs-announcement/index.html",
    "content": "President Donald Trump on Wednesday announced 25% tariffs on all cars shipped to the United States, a significant escalation in a global trade war. The tariffs, set to take effect on April 3 at 12:01 am ET, are aimed at expanding America’s auto manufacturing prowess. For decades, because of a free trade agreement, automakers have treated Canada, Mexico and the United States as one big country, with no tariffs among them. Although the United States is home to a significant automaking industry, Trump wants to grow it. “Frankly, friend has been oftentimes much worse than foe. And what we’re going to be doing is a 25% tariff on all cars that are not made in the United States,” Trump told reporters on Wednesday before signing an executive proclamation in the Oval Office. “If they’re made in the United States, it’s absolutely no tariff.” New tariffs will be applied not just to foreign-made cars but also to car parts, including engines and transmissions. The tariffs on car parts are set to take effect “no later than May 3,” according to the text of the proclamation Trump signed. Parts coming from Canada and Mexico that comply with the United States-Mexico-Canada Agreement (USMCA) will be exempt from the tariffs until US Customs and Border Protections has a system in place to apply tariffs to non-US parts, according to a fact sheet published by the White House on Wednesday. Trump said he’s been in touch with the Big Three automakers, Stellantis, Ford and General Motors. “If they have factories here, they’re thrilled,” he said. “If you don’t have factories here, they’re going to have to get going and build them.” All three companies’ stocks fell in after-hours trading after Trump’s announcement. Shares in General Motors (GM) plunged more than 7% after-hours, while Ford (F) and Stellantis (STLA), which produces Jeep, Ram, Chrysler and Dodge cars, both fell by more than 4%. It was a similar picture in Asia. In Japan, shares in Toyota (TM), the world’s largest carmaker, ended Thursday about 2% lower, while Honda (HMC) lost 2.5%. Japanese Prime Minister Shigeru Ishiba told lawmakers that “all options” against the tariffs would be on the table, while in Seoul, the government held an emergency meeting with auto makers to discuss the impact of the tariffs. “The US tariffs are expected to pose significant challenges for our automobile companies exporting a large volume to the US market,” said Ahn Duk-geun, South Korea’s trade minister. In Canada, Prime Minister Mark Carney said the tariffs were a “direct attack” in violation of the USMCA, and that Ottawa will examine its options for a response — including possible retaliatory tariffs. The tariffs threaten to upend a crucial manufacturing industry and stand to raise prices for American consumers. Half of the roughly 16 million cars, SUVs and light trucks Americans bought in 2024 were imports, a White House official said in a call with the press Wednesday. Car companies are all but certain to pass along added costs from tariffs to consumers, especially given they cannot easily move their entire supply chains to the US. And even if that were possible, it would come with hefty costs, too. The announcement comes after the Big Three automakers successfully lobbied for exemptions to 25% tariffs on all goods coming to the US from Canada and Mexico that were set to go into effect earlier this month. The exemption Trump announced allowed for autos to come in duty-free if they were USMCA-compliant. Trump later applied that to all goods coming from the two countries. However, that is exemption is set to expire on April 2, when Trump is expected to announce sweeping tariffs against America’s trading partners. The move didn’t come as a huge surprise to automakers. An executive at one of the automakers, who spoke on background to CNN on Wednesday, said they had already been working with the assumption that auto tariffs would take effect next week. “We were all kind of expecting April 2 to be our day,” said the auto executive. “But if the Trump administration has shown us anything, I mean, things are unexpected.” United Auto Workers union President Shawn Fain said he supports the tariffs. “We applaud the Trump administration for stepping up to end the free trade disaster that has devastated working class communities for decades,” he said in a statement on Wednesday. “Ending the race to the bottom in the auto industry starts with fixing our broken trade deals, and the Trump administration has made history with today’s actions.” Following Trump’s announcement, European Commission President Ursula von der Leyen condemned the tariffs. However, she said the European Union will wait to announce any retaliatory actions. “We will now assess this announcement, together with other measures the US is envisaging in the next days,” she said in a statement. Ontario Premier Doug Ford said Canada should retaliate. “I’ve spoken with Prime Minister Carney. We agree Canada needs to stand firm, strong and united,” Ford said in a post on X. “I fully support the federal government preparing retaliatory tariffs to show that we’ll never back down.” At a press conference in Kitchener, Ontario, Carney noted that Canada had slapped retaliatory tariffs on US goods before in response to Trump’s repeated taxes on Canadian exports. “We will defend our workers,” he said. “We will defend our companies, we’ll defend our country, and we’ll defend it together.” Beijing also condemned the tariffs, with a spokesperson for the Foreign Ministry saying on Thursday that “there are no winners in a trade war or a tariff war.” Unlike its Asian rivals, China’s car industry is largely insulated from this round of US levies. Last May, the Biden administration increased tariffs on Chinese electric vehicles to 100%, which has effectively shut them out of the market. Given the auto tariffs include parts, they could quickly raise the prices of new cars by thousands of dollars, according to industry experts. There is no such thing as an all-American car, since all depend on parts from Mexico and Canada for a significant part of their content. Parts from the two countries could soon be subjected to the tariffs Trump unveiled Wednesday. According to analysis by Michigan-based think tank Anderson Economic Group, the cost of producing vehicles built at US plants will rise by between $3,500 to $12,000 each. The US government tracks what percentage of each car’s parts is made “domestically.” But under current trade law, Canadian-made parts and US-made parts are all counted as the same domestic content. Even with the broader definition of “American made,” none exceed 75%. Related article\nAmerica’s automakers aren’t rushing to move production to US factories to avoid tariffs The North American car industry has operated for decades as if the continent is one giant country, thanks to free trade agreements signed by US presidents from Bill Clinton to Trump himself. Parts and whole vehicles have flowed freely across borders, sometimes multiple times, before they end up in an American dealership. Even if tariffs were only applied to fully assembled vehicles and not auto parts, they would likely raise average car prices by eliminating some lower-cost options for car buyers. Some Mexican-assembled vehicles, like the Chevrolet Blazer or Honda HR-V could be priced out of the market, and automakers might decide to stop offering them altogether rather than build them at US factories. Cars built in Mexico are most often lower-priced, lower-profit models that are only able to maintain their profitability by being built with cheaper Mexican labor. “One of the losses from tariffs tends to be a loss of product variety,” said another auto industry executive who spoke to CNN Wednesday. It’s not only the smaller, entry-level models built in Mexico that could see price hikes. Trump’s auto tariffs could impact many models that car buyers don’t realize are imports, such as the heavy-duty versions of Ram pickup trucks, which are built in a Stellantis plant in Saltillo, Mexico. Some versions of the Chevrolet Silverado are also built in Mexico. Even if the automakers shift production of those more profitable vehicles back from Mexico to US factories, it would take years to accomplish the switch. There were a total of 4 million vehicles built in Mexico in 2024, according to data from S&P Global Mobility, of which 2.5 million, or 61%, were shipped to the United States. Most of the nation’s largest automakers have assembly plants in Mexico, including General Motors, Ford and Stellantis, as well as Asian automakers Toyota, Honda, Hyundai, Nissan, Mazda and Mitsubishi and German automakers Mercedes-Benz and Volkswagen. Canadian auto plants built 1.3 million vehicles last year, of which 1.1 million, or 86%, were exported to US dealerships. Related video\n‘It’s a very strange, self-defeating set of tariffs’: Zakaria on how Trump’s policies will impact auto industry But it won’t just be Canadian and Mexican workers hurt by the tariffs. If the 3.6 million cars coming from those two countries become unaffordable, it could hit US auto parts plants that supply those countries’ assembly plants. The US exported $35.8 billion worth of parts to Mexico last year, according to federal trade data, and another $28.4 billion of parts to Canada. Parts suppliers, which employ about 550,000 workers, or nearly twice as many as work in auto assembly plants, could be forced to cut back their production and staffing if Canadian and Mexican plants shut down, even temporarily. In addition, United States car exports to Canada and Mexico reached nearly 1 million vehicles last year. There were 799,000 US-built cars, worth $14.9 billion, exported to Canada, according to data from S&P Global Mobility and the US Commerce Department. In addition, there were 160,000 US-made cars, worth $4.6 billion, exported to Mexico. That represents nearly 10% of US auto production. If those countries retaliate with their own tariffs on US-assembled vehicles, it could force some US assembly plants to scale back their own production. Cox Automotive estimates that about 30% of North American auto production, or roughly 20,000 vehicles a day, could be halted due to tariffs, assuming tariffs both on auto parts and assembled vehicles. CNN’s Junko Ogura, Yoonjung Seo, Joyce Jiang and Kathleen Magramo contributed reporting.",
    "publication_date": "Unknown"
  },
  {
    "title": "It’s the world’s hottest car company. You can’t buy one in America",
    "url": "https://www.cnn.com/2025/03/26/cars/china-byd-profile-tesla-rival-intl-hnk/index.html",
    "content": "In the world of electric vehicles, there’s a Chinese company outdoing Elon Musk’s Tesla. And it’s just getting started. BYD, the Shenzhen-based Chinese EV champion, eclipsed Tesla in annual sales last year. Last week, it unveiled a revolutionary battery charging technology that it says adds 250 miles of range in five minutes, outpacing Tesla’s Superchargers, which take 15 minutes to add 200 miles. And last month, BYD launched “God’s Eye,” an advanced driver-assistance system rivaling Tesla’s Full Self-Driving feature, at no extra cost for most of its cars. They’re just three examples of how BYD has been pulling ahead of Tesla. The company once casually dismissed by Elon Musk is now effectively outperforming Tesla in sales, innovation and price competitiveness. “They’re not resting on their laurels, as you can see from the God’s Eye announcement and from the fast-charging announcement,” Tu Le, founder and managing director of the consultancy firm Sino Auto Insights, told CNN. “They’re content to push the envelope and set the pace for the whole world.” Having dominated its home market of China, the world’s largest auto market, BYD is starting to expand globally, with notable exceptions like the United States, a country it is effectively barred from due to 100% tariffs on its passenger cars. Here’s everything you need to know about the rise of the Chinese EV maker, and how it is upending the global market for clean-energy cars. Founded in 1995 by Wang Chuanfu in China’s megacity of Shenzhen, BYD is the country’s No 1 automaker. It exports its electric taxis, buses and other vehicles to markets across Europe, South America, Southeast Asia and the Middle East. In China, BYD accounted for 32% of last year’s total sales of new energy vehicles, which include hybrids, far outpacing Tesla’s 6.1% market share, according to the China Passenger Car Association. (BYD makes both battery-powered cars as well as hybrids, while Tesla makes only fully electric vehicles powered by batteries.) BYD reported $107 billion in sales for 2024, a 29% jump from the previous year, on deliveries of 4.27 million cars, including hybrids. By comparison, Tesla’s 2024 revenue was $97.7 billion, and it delivered 1.79 million battery-powered vehicles. Its annual deliveries declined for the first time last year by 1.1%. While BYD’s battery-powered EV shipments of 1.76 million vehicles were marginally short of Tesla’s, investors and analysts are bullish on BYD’s potential as it expands overseas. Most of BYD’s shipments were delivered to domestic customers with just 10% exported to overseas markets. “We believe sales momentum will remain robust for 2025, and BYD will be able to retain its leadership with the rollouts of new-generation models equipped with the advanced driver-assistance system,” Vincent Sun, Morningstar’s senior equity analyst, wrote in a Monday research note. While many believe BYD stands for “Build Your Dreams,” Wang said in an interview for Tencent that it originally had no such meaning. It was simply an “odd” combination of three Chinese characters “bi ya di,” he told the online interview program. The slogan “Build Your Dream” was conceived later for marketing purposes. BYD’s top-selling passenger vehicles are the Qin and Song models, which cater to a broad swath of consumers drawn to the company’s reputation for affordability. The Qin, a compact sedan, is available as both a plug-in hybrid and a fully electric model, while the Song comprises a lineup of compact crossover SUVs. Unlike Tesla, which has positioned itself as a premium brand, BYD has built its success on price accessibility. Its entry-level model starts at just over $10,000 in China, a fraction of the cost of Tesla’s least expensive Model 3, which sells for more than $32,000. Though BYD’s passenger cars have yet to enter the US market due to high tariffs, its electric buses are already in service in California. Wang was born in 1966 to a simple rural family in Anhui province in eastern China. But disaster struck when both of his parents died young, leaving him orphaned when he was in middle school, according to The Paper, a Chinese state-owned publication. Wang relied on his older brother to provide for him and his education. Wang spent several years at the state-owned Beijing Nonferrous Metals Research Institute, where he got his master’s degree. The institute later established a battery company in Shenzhen and dispatched him there. Wang soon sensed an opportunity. He started BYD with a team of around 20 people and 2.5 million yuan ($351,994) that Wang borrowed from his cousin, according to The Paper. He quickly achieved initial success by leveraging China’s cheap labor force, upending an industry once monopolized by Japanese companies. In 2003, Wang followed his instincts, venturing into the car industry by acquiring a struggling state-owned automaker for 269 million yuan ($38 million). Its investors were worried, sending the company’s shares plunging by more than 30%. But Wang was unrepentant. The automaker he acquired had little to offer technologically speaking, Wang recalled in the interview, so he bought many second-hand cars from around the world and took them apart to study. “Toyota, being the world’s number one automaker, its craftsmanship, design, and products are worth learning from — only by standing on its shoulders can we reach new heights,” he said in the Tencent interview. He was eventually vindicated, receiving a $230 million investment in 2008 from Warren Buffet, whose endorsement garnered him worldwide attention. BYD didn’t start off making cars. It was a battery maker first, which Wang said cemented the firm’s foundation and set it up for success. “The bottleneck for electric vehicles is the battery,” he said in the Tencent interview. “If you master battery technology or accurately predict its future direction, you are essentially setting the strategic course for the entire EV industry.” Like Apple founder Steve Jobs and Tesla CEO Elon Musk, Wang, who had studied metallurgical chemistry, was obsessed with engineering details and remains so today. He said in the Tencent interview that he spends around 60% to 70% of his time on technology and only the rest on management. One of the innovations born out of BYD’s focus on technology is its blade battery, a lithium iron phosphate battery that it pioneered in 2020. The company said the unique shape allows it to maximize the use of available space in the battery pack while reducing the chances of catching fire when damaged. Beyond batteries, BYD also makes a high percentage of its components in-house, relying less on external suppliers in comparison with other carmakers. This vertical integration allows it to scale up its production more easily and drive down cost significantly, according to Le. BYD has also been known for its aggressive pricing strategy amid an ongoing price war in China and isn’t shy about asking its suppliers for discounts. For now, BYD and other Chinese EVs are virtually locked out of the US market due to tariffs. But as BYD evolves, Le said, trade barriers might give certain companies a “false sense of security.” “They’re not planning to take their foot off the gas on research and development spend this year, so it’s going to be a consistent onslaught probably through the end of this decade,” he said. Despite its lack of US presence, BYD is making inroads elsewhere. Wang has pledged to increase its total shipments by nearly 30% this year and nearly double its overseas deliveries to more than 800,000 vehicles, according to state media. But some challenges have emerged. “Aside from the geopolitics, I think there are more challenges in how they operate in different countries,” said Lei Xing, an independent analyst focusing on China’s auto industry. In Brazil, authorities said in December they had found workers working in “slavery-like conditions” at a BYD construction site. The company later denied those accusations. In Mexico, Beijing is reportedly delaying approval for a local plant because of concerns that BYD’s smart car technology could potentially be transferred to the US, according to the Financial Times. Still, some analysts believe BYD has become an unstoppable force. With an intense focus on technology, Xing said BYD is poised to deliver new advancements, whether in price or innovation. “They’re just starting,” he said.",
    "publication_date": "Unknown"
  },
  {
    "title": "Copper prices surge to record high amid tariff anxiety",
    "url": "https://www.cnn.com/2025/03/26/investing/copper-record-high-tariff-anxiety/index.html",
    "content": "Gold isn’t the only metal smashing through record high prices. Copper prices in New York hit a record high on Wednesday after Bloomberg reported that President Donald Trump might impose tariffs on copper imports in the coming weeks. Wall Street had expected tariffs on copper to come later this year. The most actively traded copper futures contract in New York hit $5.374 per pound Wednesday morning before settling at a record $5.24 per pound. Copper prices have soared 30% this year, largely driven by US buyers trying to stockpile the red metal due to anxiety around potential tariffs. Copper prices have outpaced gold, which has gained 16%, and far outpaced the major US stock indexes this year. While tariffs on copper have yet to be announced, Trump signed an executive order last month to investigate the national security risks associated with importing copper. “Copper, a key industrial metal that has yet to be included in Trump’s widening catalogue of tariff-hit products, continues to rally on the assumption that it is just a matter of time,” said Ole Hansen, head of commodity strategy at Saxo Bank, in a recent note. Copper is not a rare earth mineral nor one of the 50 “critical minerals” designated by the US Geological Survey. However, in 2023, the Department of Energy deemed it a “critical material for energy.” The malleable metal is widely used in construction and manufacturing and has essential purposes for electronics, energy and defense. The recent price spike in New York copper futures isn’t due to fundamental consumer demand, but rather “major stockpile shifts to the US” due to speculation around tariffs, according to Hansen. Related article\nTrump’s tariff problem: He might need a third or fourth term for his plan to work In London, copper prices have also risen, though not to record highs. Since January, copper futures traded in New York have begun to outpace copper futures traded in London, breaking away from their trend of tracking each other. New York copper futures are now trading at a 17% premium, according to Hansen. “It highlights how tariffs continue to uproot normal market behavior,” he said. Commodities giant Mercuria estimates that about 500,000 tons of copper are being shipped to the US this month — a significant boost from the standard monthly import of about 70,000 tons, according to Bloomberg. “Front-running the potential tariff has unleashed a wave of near-term demand for copper housed in the US,” said Adam Turnquist, chief technical strategist at LPL Financial. “We think shipments to the US will likely be fast tracked,” analysts at Goldman Sachs said in a Wednesday note, adding that imports of copper in April could jump 200,000 tons. The analysts at Goldman Sachs said they had initially been expecting tariffs on copper to go into effect between September and November. While the recent surge in copper prices has primarily been driven by tariff anxiety, other factors have also underpinned copper’s rise over the past year. There has been increasing global demand for copper in energy and technology like electronic vehicles, as well as continued demand in China. The recent US stockpiles could leave the rest of the world with a smaller reserve, according to Hansen. The world is expected to meet only 70% of global copper demand by 2035, according to the Paris-based International Energy Agency. Glencore, a commodities giant, suspended production at one of its copper smelters in Chile this month, creating a lull in supply that is also contributing to higher prices, according to Reuters. But despite all the uncertainty and speculation, Wall Street will ultimately have to wait and see what Trump’s actual policy is toward tariffs on copper. “There may be a price correction, at least temporarily, as soon as the pull-forward effect on US demand comes to an end,” analysts at Commerzbank said in a Tuesday note.",
    "publication_date": "Unknown"
  },
  {
    "title": "Gabby Jones/Bloomberg/Getty Images",
    "url": "https://www.cnn.com/2025/03/25/tech/how-to-use-signal-app-privacy-encryption/index.html",
    "content": "If you hadn’t heard of Signal before Monday, chances are you have now. The secure messaging app, available for iPhones and Android devices, has long been popular with journalists because of its robust privacy features. But the Atlantic’s editor in chief, Jeffrey Goldberg, revealed on Monday that he had been added to a group chat with President Donald Trump’s Cabinet members about military strikes on Yemen – raising serious national security concerns. While Signal offers more privacy perks compared to other messaging apps, it’s not meant for sharing classified government and military information. Some factors are beyond the app’s control – such as who the user is contacting, and whether the devices running the app are secure. “In the specific case of Signal, messages may be secure when they are in transit between phones, but once they reach the recipient, security can indeed fail,” Matthew Mittelsteadt, a technology policy research fellow for the Cato Institute, said in an emailed statement to CNN. However, if you use the app as intended, there are a lot of protections built into Signal to help prevent conversations from falling into the wrong hands. Unlike other popular messaging apps, Signal is operated by a non-profit called the Signal Technology Foundation rather than a for-profit tech giant like Meta, which owns popular messaging apps like Instagram and WhatsApp, or Apple, whose iMessage platform is available across the company’s devices. Still, the process of using Signal is similar to other messaging apps; you can send individual messages, create group chats, make phone calls and even post disappearing “stories” like those available on Instagram and Snapchat. There are no ads or trackers on Signal either, and you can set messages to disappear after a certain amount of time, from as quickly as 30 seconds to as long as four weeks. Communications on Signal, including Signal Stories and your user profile, are end-to-end encrypted by default. That means the data is scrambled in transit and can only be seen by the sender and recipient. Signal can’t access the content of messages or calls, nor can it see display names or profile pictures, according to its privacy policy and support page. “If you show up with a warrant or a subpoena (to Signal), they have almost nothing about you that they can hand over,” Eva Galperin, director of cybersecurity at the Electronic Frontier Foundation, told CNN last month. Message history is stored on a user’s device rather than in Signal’s servers, although it does queue messages on its servers to be delivered later for devices that are temporarily offline. Signal also has something called a “safety number,” which is a code assigned to an individual that helps you verify messages are going to the intended recipient. Some of these features, like end-to-end encryption, have become increasingly common in messaging apps. But it’s the combination of these privacy tools that makes Signal stand out from other apps. Other apps that offer end-to-end encryption may still have access to different types of information, like non-encrypted contacts, Daniel Kahn Gillmor, a senior staff technologist for the ACLU’s Speech, Privacy, and Technology Project, said in a previous CNN interview. Signal is available on the iPhone’s App Store and the Google Play Store for Android devices. You must have a phone number capable of receiving a text message or phone call, since a verification code is required to set up your profile. However, you can choose to hide your phone number when connecting with others on the platform. Tapping the message icon in the top right allows you to start a new message. From here, you can search for contacts in your phone’s contact list that are on Signal, or find someone by their username or phone number. If you get a new phone, you need your old device to transfer your message history since conversations are stored on your device. Once you’re on Signal, you can manage conversations by tapping the recipient’s name at the top of the screen. From there, you can view their safety number, choose to have messages disappear after a certain amount of time, give the contact a nickname or mute notifications. If you’re really concerned about privacy, there are more granular features to dig into, such as the ability to hide the Signal app’s contents when switching between apps on your phone. While features like these can help prevent messages from being sent to the wrong contact, once you’ve hit the send button, the recipient will see it unless you delete or edit it before they view it. “One thing people frequently don’t understand about end-to-end encrypted apps, is that your communications are encrypted so no one in the middle can see them,” Galperin said in a previous CNN interview. “But the person you’re talking to can still see them.” CNN’s Clare Duffy contributed to this report.",
    "publication_date": "Unknown"
  },
  {
    "title": "Sheldon Cooper/SOPA Images/LightRocket/Getty Images/File",
    "url": "https://www.cnn.com/2025/02/09/tech/secure-chat-apps-signal-tor-browser/index.html",
    "content": "As we all live more of our lives online, it’s important to understand who might have access to our conversations and internet searches – and to understand how to maintain privacy in an increasingly connected world. In the days since billionaire Elon Musk and his Department of Government Efficiency associates have blazed through various government agencies, journalists have encouraged federal government workers to contact them through end-to-end encrypted platforms, like the messaging app Signal. Signal is one of a number of relatively simple tools that can be used not only to help keep secure conversations with reporters, but also for communicating with colleagues when not discussing work projects, researching legal resources or even chatting with friends. It’s safe to assume that anything you do on a work computer or phone could be visible to  your employer, because they have the right to monitor usage of devices they own. “You want to think about who has access to the communications that you’re making if you’re worried that someone might try to retaliate you for having these discussions,” said Daniel Kahn Gillmor, a senior staff technologist for the ACLU’s Speech, Privacy, and Technology Project. With that in mind, it’s a good idea to use a personal device for personal conversations and Google searches. The same goes for using an employer’s Wi-Fi network, on which they may be able to connect the dots between employee communications. Save any griping about work for your home network or your personal phone plan. On work Wi-Fi, “they won’t necessarily see what tea you’re spilling, but they will see who you’re spilling it to,” Gillmor said. There are a number of tech platforms that advertise encryption services for privacy — including iMessage and WhatsApp — but data security experts largely agree that Signal is the gold standard. Signal looks like a regular messaging app for texting and making phone calls. But it’s owned by a non-profit, not a private company, and the app is end-to-end encrypted by default. That means that the content of a conversation is scrambled when it’s traveling between the sender and receiver, so no one except the parties to the conversation can see it. Related article\nThey lived through Elon Musk’s Twitter takeover. Now, they have advice for federal government employees “If you show up with a warrant or a subpoena (to Signal), they have almost nothing about you that they can hand over,” said Eva Galperin, director of cybersecurity at the Electronic Frontier Foundation. On non-encrypted messaging apps, an employer or law enforcement could potentially force a platform to hand over a user’s conversations via subpoena. End-to-end encryption itself isn’t unique among messaging apps, but certain apps that offer encryption, like WhatsApp, may still have access to non-encrypted contacts and other accounts you’ve messaged, whereas Signal’s builders can’t see that information, according to Gillmor. And whether you use Signal or WhatsApp, experts advise turning on the “disappearing messages” feature that allows users to auto-delete conversations after a set period of time — hours, or days, depending on what a user selects — so that the conversations might not be accessible even if someone else got their hands on a user’s phone. Many people are familiar with VPNs, or virtual private networks, which act kind of like a tunnel between your device and the internet that can mask where your internet traffic is coming from. VPNs can be a more private way of accessing the internet, but nevertheless, the VPN company could, in theory, be forced to hand over the information it has about your internet traffic. “When you use a VPN, the VPN company can see all your traffic, they see where you’re coming from and where you’re going. So, if somebody on the other end of the transaction sees an IP address that belongs to a VPN company, they can submit a subpoena to the VPN company,” Galperin said. The most secure option, security experts say, is to use Tor browser. It’s a browser that users can download just like Firefox or Safari, but that distributes internet traffic across a global network of different “nodes,” or computers, so that any one user’s traffic could not be accessed from a single access point. With Tor, the websites a user visits are also blocked from viewing that user’s IP address, which could allow them to be identified. If you’ve used Tor and “someone later sends a warrant to Google asking for all the searches that have been made from your home computer or your logged-in Google browser, they won’t see searches for ‘good journalist to leak to,’” Galperin said. Many news organizations also have SecureDrop folders, allowing users to share encrypted documents and communications anonymously when using Tor. Some companies have taken aggressive measures to identify employees who leak information, such as watermarking or tweaking emails so that different employees receive slightly different versions of the same message. For that reason, security experts encourage people to be cautious about sending exact copies or photos of emails or documents. And any documents printed out could include “printer dots,” invisible tracking codes that can indicate the time, date and location where something was printed. And keep in mind that violating a non-disclosure agreement or sharing confidential information could expose you to legal risk if you are identified. Still, Gillmor said it can be a good idea to identify private channels of communication with colleagues or friends. “Protecting our rights is a team sport,” Gillmor said. “Taking the time to figure out how to do some of these things and helping your friends figure out how to do these things, even if you never end up using them in more drastic ways … is still a positive thing.”",
    "publication_date": "Unknown"
  },
  {
    "title": "Tiffany Hagler-Geard/Bloomberg/Getty Images",
    "url": "https://www.cnn.com/2025/03/25/tech/23andme-bankruptcy-how-to-delete-data/index.html",
    "content": "Many 23andMe customers signed up to the genetic testing service in hopes of learning fun or interesting information about their past. But consumer advocates are now urging those users to request the deletion of their accounts and data from the site, to prevent their genetic information from ending up in unexpected hands. San Francisco-based 23andMe filed for Chapter 11 bankruptcy protection on Sunday and said it would pursue a sale, after years of struggling to find a sustainable business model. That means the company — and the genetic information of its 15 million customers — will likely soon be up for grabs to the highest bidder. At least while the company goes through the sale process, it says it won’t change how it manages or protects customer data. And 23andMe board chair Mark Jensen said in a statement that “data privacy will be an important consideration in any potential transaction.” But a new owner could still mean big changes in how user data is handled and what it’s used for. “There’s health insurance companies that are interested in this data, there’s life insurance companies that are interested in this data,” California Attorney General Rob Bonta told ABC News7 on Monday. Bonta issued a consumer alert on Friday urging users of the site to consider deleting their accounts. On Monday, New York Attorney General Letitia James also issued an alert encouraging customers to “take action to safeguard their data” amid 23andMe’s bankruptcy proceedings. Here’s how to delete your 23andMe account — and why it matters. 23andMe has tried to reassure customers by pointing to its privacy policy, which currently states that the company won’t sell customers’ identifiable genetic data, and that they’ll only share data with researchers if customers opt in. The privacy policy states that if users’ data is sold as part of a bankruptcy or acquisition, the same provisions will apply to that personal information under the new entity. But the policy also states that it can be changed at any time. “That’s just standard language in companies’ privacy policies,” Anya Prince, law professor at the University of Iowa College of Law, said in an interview with CNN’s Terms of Service podcast. And that matters because people’s DNA can reveal more than just insights into their family history — it could also be used, for example, to tell something about their future health outlook. Data from online genetics services have also been used by law enforcement to help solve crimes, although 23andMe’s current policy says it won’t share information with police without a legally valid warrant. There is a federal law, the Genetic Information Nondiscrimination Act, that prohibits employers and health insurances companies from discriminating based on genetic information, but the law is not “foolproof” and doesn’t apply to life insurance companies and other types of services, Prince said. “Theoretically, the new company could have a similar ethos that the consumer feels good about, but the new company might have a completely different ethos,” Prince said. To delete data from 23andMe, customers should log in to their account and navigate to the “Settings” section of their profile. At the bottom of the page, click on “23andMe Data,” and then “View.” Users can then download their genetic data for their own, personal use before scrolling to the “Delete Data” section and clicking “Permanently Delete Data.” If customers previously opted to have their saliva sample retained by 23andMe, they can also request that it be discarded under their account settings page, under “Preferences.” And users can also withdraw consent to have their genetic information used by third-party researchers under “Research and Product Consents.” In an interview with ABC News on Monday, Bonta warned that consumers could encounter a slow or glitchy website when they go to delete their information, but encouraged them to keep trying. “I was attempting to delete my data today, and the website was down today at times,” Bonta said, adding that the outage may have been caused by heavy traffic to the site with many people seeking to delete their data.",
    "publication_date": "Unknown"
  },
  {
    "title": "Bridget Bennett/Bloomberg/Getty Images",
    "url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
    "content": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest on Tuesday, according to a spokesperson for the South Korean tech giant. Han was 63. Born in 1962, Han had overseen Samsung’s consumer electronics and mobile devices businesses since 2022, according to the company. He was named Samsung Electronics vice chairman and CEO in 2022. Han’s co-CEO, Jun Young-Hyun, was appointed to the position last week. The spokesperson told CNN that Jun, who has been leading the semiconductor business, would be the company’s sole CEO after Han’s death. In an internal message seen by CNN, Samsung paid tribute to Han, saying he had dedicated more than 37 years of his life to leading Samsung’s TV business to become a global leader. As the head of its electronics and appliances businesses, he also contributed to the company’s growth amid a “challenging business environment.” “Our deepest condolences are with his family and loved ones during this difficult time,” the message said. The electronics giant has run into significant headwinds in recent years. Its logic semiconductor business trails contract chipmaking industry leader Taiwan Semiconductor Manufacturing Company (TSMC) both in terms of ramping up production of cutting-edge chips and securing major customers. On the memory side of the chip business, which has long been a strength for Samsung, analysts say it has fallen behind South Korean rival Hynix in the market for high bandwidth memory (HBM) technology, which has contributed to a slump in its share price. HBM chips are essential for the graphic processing units created by the likes of Nvidia. During an annual meeting with investors last week, which he chaired, Han apologized for the performance of Samsung stock and warned of a difficult 2025 because of uncertainties around the economic policies of major economies, according to Reuters. He added that Samsung would seek “meaningful” mergers and acquisitions deals this year to support the company’s growth. “There are some difficulties in doing semiconductor M&As due to regulatory issues and various national interests, but we’re determined to produce some tangible results this year,” he was quoted as saying. Han joined the company in 1988 after earning a bachelor’s degree in electrical engineering from Inha University. Prior to running Samsung’s electronics and devices division, he was in charge of the display operation. Han was “central” in rolling out Samsung’s LED TVs, which, along with other innovations of his, helped the company “continually demonstrate technology leadership,” Samsung said in a company biography published last week. This story has been updated with additional reporting and context.",
    "publication_date": "Unknown"
  },
  {
    "title": "Hou Yu/China News Service/VCG/Getty Images",
    "url": "https://www.cnn.com/2025/03/25/tech/china-robots-market-competitiveness-intl-hnk/index.html",
    "content": "Spinning bright red handkerchiefs and dancing in step to folk music, more than a dozen human-like robots took to China’s biggest stage in January, making a splashy debut at the annual Lunar New Year gala. The remarkable performance, watched by more than a billion people, is a high-profile reminder of how far Chinese humanoid robots have come. Over the past two months, videos of the country’s humanoid robots pulling off moves such as bike rides, roundhouse kicks and side flips have blown up the internet, often amplified by state media as a key potential driver of economic growth. Even though very few of the humanoids are in mass production, competition with Elon Musk’s Tesla, one of the acknowledged frontrunners in the field, is heating up. The promise of an “I, Robot” future, where machines handle household chores and serve as caregivers, has drawn nearly every major tech company in both the United States and China to bet on humanoids or robotics. Microsoft, Nvidia and Amazon founder Jeff Bezos have invested in American humanoid maker Figure AI. Meanwhile, Meta is planning major investments in humanoids, according to a Bloomberg report last month. Musk, whose Optimus humanoid has sparked global interest since its debut in 2022, predicted last month that the project alone could generate more than $10 trillion in revenue. While it may take another five to 10 years for humanoid robots to make a real societal impact, they could eventually become the next widely adopted consumer electronics, according to Xi Ning, chair professor of robotics and automation at the University of Hong Kong. “Everybody will need them, like automobiles, like cellphones, and the potential market volume will be huge,” he told CNN. Goldman Sachs projected last year that the global humanoid robot market will be worth $38 billion by 2035. In five years, they estimate that 250,000 humanoid units, mainly for industrial use, will be shipped, while consumers will be buying about one million units a year in about a decade. Beijing, which is looking to replicate China’s success in the electric vehicle (EV) market, wants to be at the forefront of that growth. It’s eager to position the country as a global tech powerhouse and build on the momentum of recent Chinese achievements in the field - such as AI startup DeepSeek’s reasoning model that stunned the world in January - especially as the US tightens tech restrictions on Beijing. Despite entering the race later than American rivals including Tesla, Boston Dynamics and Figure AI, experts say Chinese firms are rapidly closing the gap. With their preternatural ability to optimize supply chains and cut costs, Chinese firms are also accelerating the mass production of humanoids. China already dominates the space for industrial robots, deploying more of them every year since 2021 than all other countries combined, according to the International Federation of Robotics, a Germany-based non-governmental organization. Compared to humanoids, industrial robots typically feature less advanced technology and perform less sophisticated tasks. They’re widely used in industrial settings for manufacturing or transportation. As with EVs, Tesla was one of the few big-name frontrunners for humanoids when Musk introduced the project in 2021 and showcased an Optimus prototype a year later. Since then, Beijing has publicly thrown its weight behind the humanoid robotics industry with increasing funding drives and government support. In a 2023 policy document, China’s Ministry of Industry and Information Technology identified the humanoid robotics industry as a “new frontier in technological competition,” setting a 2025 target for mass production and secure supply chains for core components. “China started relatively late, but it has its own advantages like a huge market and a relatively complete supply chain for the technology, which enables them to easily develop similar kind of robots at lower price,” said Xi at the University of Hong Kong. Over the past three years, various local governments – including major cities like Beijing, Shanghai and Shenzhen – have announced plans to establish or have launched investment funds dedicated to developing robotics, totaling at least 73 billion yuan ($10 billion), according to a tally by CNN. Last month, Chinese leader Xi Jinping chaired a high-profile meeting with the country’s top business executives. Among those seated in the front row was Wang Xingxing, CEO of Unitree, the company behind the viral dancing robots, an indication of Beijing’s growing focus on this emerging sector. Aside from Unitree, other major domestic players include Shenzhen-based UBTech, Chinese EV giant BYD-backed Agibot, Beijing-based Robotera and Shanghai-headquartered Fourier Intelligence, as well as EV maker XPeng. Experts say China still trails the West in certain key technologies, even as it dominates the supply chain.  About 56% of the humanoid robot supply chain companies are based in China, according to a Morgan Stanley research report last month. Related video\n‘Meet my new friend.’ Kim Kardashian interacts with Tesla Bot But China still needs to achieve a breakthrough in “core technologies,” such as processor chips, high-precision sensor and robot operating systems, to reduce its reliance on foreign technology, said Zhang Dan, chair professor of intelligent robotics and automation at the Hong Kong Polytechnic University. Artificial intelligence chips underpin humanoids’ operating systems, guiding their thinking, perception and motion. Many humanoid developers depend on AI chip giant Nvidia’s products. At its annual developer conference last week, the company unveiled a new AI foundation model for humanoid robots. Citing national security concerns, the former Biden administration steadily tightened export restrictions on advanced chips that could power China’s military. Beijing has sought to develop its domestic chip supply chain as part of its self-sufficiency drive. Additionally, European, American and Japanese companies continue to dominate higher-end components such as sensors, as well as motors and screws that power robotic motions with higher precision and stability, according to a Morgan Stanley report last month. To overcome those shortcomings, Chinese suppliers are actively trying to do business with Tesla. Many of them have sent component samples for Tesla’s review, according to P.K. Tseng, a senior research manager at TrendForce, a market analysis firm. “After Chinese supply chain manufacturers supply components to Tesla, they refine them based on testing feedback and then offer the improved versions to domestic manufacturers,” he said. Over time, this creates a cycle of continuous technological advancements, enhancing the quality of the whole domestic humanoid robotics industry, he explained. While technological gaps remain, China has emerged as a price disrupter in the nascent industry. Shenzhen-based Engine AI released its PM01 model late last year for just 88,000 yuan ($12,175), while Unitree’s G1, capable of executing a roundhouse kick, followed at 99,000 yuan ($13,697). Related article\nA Chinese EV giant is now offering free driver assistance tech on cars under $10,000 At an event last year, Musk estimated Tesla’s Optimus to be priced between $20,000 to $30,000. Lowering prices for humanoids would mark a major step to their eventual commercialization and wider adoption. Beyond startups, established EV players like BYD and XPeng have also ventured into the humanoids space. Experts said years of cutthroat competition and a price war in China have honed their ability to scale production rapidly while driving cost down. Since the manufacturing complexity of humanoid robots shares similarities to those of electric vehicles, particularly in components like sensors and batteries, EV makers have an advantage in this space, according to Brady Helwig, associate director for economy at Special Competitive Studies Project, a US thinktank. Late last year, XPeng unveiled its humanoid robot, Iron, with plans for mass production by the end of 2025. Around the same time, BYD launched a recruitment drive to develop its own version, having invested in other domestic humanoids makers. As the country’s demographic crisis worsens, the Chinese leadership sees humanoid robots as a potential solution to offset the shrinking working force, Helwig said. China’s population has shrunk for three consecutive years. “If humanoid robots were able to be scaled and deployed widely across the economy, this is the kind of wild card that could really help alleviate that gap,” he said. CNN’s Hassan Tayir contributed reporting.",
    "publication_date": "Unknown"
  },
  {
    "title": "George Frey/Reuters",
    "url": "https://www.cnn.com/2025/03/24/tech/23andme-bankruptcy-hnk-intl/index.html",
    "content": "Gene testing firm 23andMe said on Sunday it had filed for Chapter 11 bankruptcy protection in order to facilitate its sale, after years of struggling to find a sustainable business model. In a statement announcing the bankruptcy, the firm said its CEO, Anne Wojcicki, had resigned effective immediately. She will remain on the company’s board of directors. “After a thorough evaluation of strategic alternatives, we have determined that a court-supervised sale process is the best path forward to maximize the value of the business,” Mark Jensen, chair and member of the Special Committee of the board of directors, said in the statement. Late last year, the company said it was cutting about 40% of its workforce - around 200 employees - and discontinuing further development of all its therapies as part of a restructuring program, according to Reuters. In September, all seven of the company’s independent directors resigned en masse, citing their frustration with the CEO’s “strategic direction” and efforts to take 23andMe private. The company, which went public in 2021, had never made a profit. The stock shot up following the listing, briefly valuing the company at $6 billion. Wojcicki, who owned 49% of the company, became a billionaire. Its core product, an at-home DNA testing kit, offers “personalized genetic insights” that the company says can flag potential health risks such as one’s likelihood of developing Alzheimers or certain cancers. 23andMe tried to convert one-time buyers into subscribers with the promise of continued feedback and personalized wellness plans but had reportedly fallen short of its goals. This story has been updated with additional reporting and context.",
    "publication_date": "Unknown"
  },
  {
    "title": "Justin Sullivan/Getty Images",
    "url": "https://www.cnn.com/2025/03/20/tech/meta-whistleblower-sarah-wynn-williams-response-congress/index.html",
    "content": "Former Facebook executive-turned-whistleblower Sarah Wynn-Williams says Meta is blocking her from speaking to Congress about her experiences at the company. This arises from arbitration proceedings with the company after Wynn-Williams published her memoir “Careless People,” detailing her time at the social media giant, earlier this month. Meta moved quickly to stop her from promoting or discussing the book, which it claimed contained “out-of-date” claims and “false accusations.” On the day of the book’s publication, the company filed an arbitration demand stating that the claims in the book violate a voluntary non-disparagement agreement she signed upon leaving the company. A day later, the arbitrator temporarily ordered her not to make any “disparaging, critical or otherwise detrimental comments” related to Meta and to stop promoting the book. That order is now preventing Wynn-Williams from responding to requests from lawmakers in several countries to discuss her time at the company, her lawyers wrote in a response in the arbitration proceedings obtained by CNN. “Members of the United States Congress, the Parliament of the United Kingdom, and the Parliament of the European Union have requested to speak with Ms. Wynn-Williams on the issues of public concern raised in her memoir,” including the company’s interactions with the Chinese government and Meta’s alleged harms to teen girls, the document, filed Tuesday, states. But under the order, Wynn-Williams “appears to be blocked from speaking” with those lawmakers. Related article\nEx-Meta executive: ‘People deserve to know what this company is really like’ Wynn-Williams’ response in the arbitration proceedings has not been previously reported. “Careless People” includes striking details about Wynn-Williams’ time at the company, ranging from the social media giant’s efforts to expand into China and alleged sexual harassment by now-policy chief Joel Kaplan. The arbitrator’s emergency order prevents Wynn-Williams from making any critical comments about the company even if she believes them to be true, according to a filing Meta shared publicly earlier this month. The emergency order also notes that Wynn-Williams is not prevented or prohibited from “filing a claim with a federal, state, or local government agency that is responsible for enforcing a law on behalf of the government.” However, her response states that because legislative bodies are not responsible for enforcing laws, she is blocked from speaking to lawmakers. A Meta spokesperson said the company has no intention to interfere with Wynn-Williams’ legal rights. Wynn-Williams also filed a whistleblower complaint with the Securities and Exchange Commission in April 2024 and with the Department of Justice in 2025, according to her filing. Wynn-Williams’ memoir comes as Meta has faced years of scrutiny and increased regulatory pressure from lawmakers around the world over issues such as teen safety and election misinformation. Two other former employees have also testified as whistleblowers, and the company’s executives have repeatedly been called to hearings on Capitol Hill. Wynn-Williams spent six years at the company, now called Meta, most recently as director of global public policy, before she was fired in 2017, which the company said was due to “poor performance and toxic behavior.” Wynn-Williams’ book implies that she was fired in retaliation for reporting sexual harassment. Meta had sent a letter to Wynn-Williams’ publisher prior to the book’s publication, saying it had made “no attempt” to verify her claims with the company and threatening legal action if the book contained false statements or implications. But despite Meta’s efforts to block the book, it debuted this week on the New York Times’ best seller list. “The public interest is suffering due to her inability to respond to outreach from legislators, journalists, and the public,” the document states. It later adds: “The public interest balance here tips sharply in Ms. Wynn-Williams’s favor, as demonstrated by the interest in her evidence from U.S., UK, EU and other national and supra- national legislatures and regulatory bodies.”",
    "publication_date": "Unknown"
  }
]